stubs/src/main/resources/wsdl/cte4/mg/hom/status_service.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.2-1 git-revision#dbe58a8. --><!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is JAX-WS RI 2.3.2-1 git-revision#dbe58a8. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://www.portalfiscal.inf.br/cte/wsdl/CTeStatusServicoV4" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.portalfiscal.inf.br/cte/wsdl/CTeStatusServicoV4" name="CTeStatusServicoV4">
<types>
<xsd:schema>
<xsd:import namespace="http://www.portalfiscal.inf.br/cte/wsdl/CTeStatusServicoV4" schemaLocation="https://hcte.fazenda.mg.gov.br:443/cte/services/CTeStatusServicoV4?xsd=1"/>
</xsd:schema>
</types>
<message name="cteStatusServicoCT">
<part name="cteDadosMsg" element="tns:cteDadosMsg"/>
</message>
<message name="cteStatusServicoCTResponse">
<part name="cteStatusServicoCTResult" element="tns:cteStatusServicoCTResult"/>
</message>
<portType name="CTeStatusServicoV4Soap12">
<operation name="cteStatusServicoCT">
<input wsam:Action="http://www.portalfiscal.inf.br/cte/wsdl/CTeStatusServicoV4/cteStatusServicoCT" message="tns:cteStatusServicoCT"/>
<output wsam:Action="http://www.portalfiscal.inf.br/cte/wsdl/CTeStatusServicoV4/CTeStatusServicoV4Soap12/cteStatusServicoCTResponse" message="tns:cteStatusServicoCTResponse"/>
</operation>
</portType>
<binding name="CTeStatusServicoV4Soap12Binding" type="tns:CTeStatusServicoV4Soap12">
<soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="cteStatusServicoCT">
<soap12:operation soapAction="http://www.portalfiscal.inf.br/cte/wsdl/CTeStatusServicoV4/cteStatusServicoCT"/>
<input>
<soap12:body use="literal"/>
</input>
<output>
<soap12:body use="literal"/>
</output>
</operation>
</binding>
<service name="CTeStatusServicoV4">
<port name="CTeStatusServicoV4Soap12" binding="tns:CTeStatusServicoV4Soap12Binding">
<soap12:address location="https://hcte.fazenda.mg.gov.br:443/cte/services/CTeStatusServicoV4"/>
</port>
</service>
</definitions>